app/controllers/api/v1/users_controller.rb

  def cities
    respond_with City.all.as_json(only:[:id, :name])
---
SELECT `cities`.* FROM `cities`

  def get
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 34 LIMIT 1

  def create
    new_parms = user_params
    new_parms[:password] = params[:password]
    new_parms[:password_confirmation] = params[:password_confirmation]
    respond_with User.create(new_parms).auth_token
---
INSERT INTO `users` (`address`, `auth_token`, `cellphone`, `city_id`, `created_at`, `email`, `last_name`, `name`, `password_digest`, `phone`, `updated_at`) VALUES ('Cerca', '011835936ee9d026daba3e7aeb663193', '1234567891', 1, '2014-05-10 01:47:49', 'puca3@gmail.com', 'Perez', 'Johana', '$2a$10$02iezVjo7UrkM/tOO9iv7e8I59zd7vf0mfxAKZPoIyBlHO17Wla/y', '1234567891', '2014-05-10 01:47:49')

  def update
    new_parms = user_params
    new_parms[:password] = params[:password]
    new_parms[:password_confirmation] = params[:password_confirmation]
    @user = User.find_by_email(new_parms[:email])
    if @user.update_attributes(new_parms)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'puca@gmail.com' LIMIT 1
UPDATE `users` SET `name` = 'juan Octavio', `password_digest` = '$2a$10$qcgGEjHckmrWJtrMA36VwewkmIzhKi6sPTOgldoN/93PvB7aCZLiq', `updated_at` = '2014-05-09 21:25:11' WHERE `users`.`id` = 33

  def login
    @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'puca2@gmail.com' LIMIT 1