app/controllers/ads_controller.rb

  def create
    @ad = Ad.new(ad_params)
    if @ad.save
      redirect_to controller: "ads", action: "show"

    else
      @vehicles = Vehicle.all
---
SELECT `vehicles`.* FROM `vehicles`

  def new
  @vehicles = Vehicle.all
    Vehicle.find_by_model_id(Model.find(1).id)
---
SELECT `vehicles`.* FROM `vehicles`
SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`model_id` = 1 LIMIT 1