app/controllers/users_controller.rb

SELECT `cities`.* FROM `cities`
---
  def new
    @cities = City.all

INSERT INTO `users` (`address`, `auth_token`, `cellphone`, `city_id`, `created_at`, `email`, `last_name`, `name`, `password_digest`, `phone`, `updated_at`) VALUES ('too long', '23783e1a14a574e066ef12914bd03095', '1234567891', 1, '2014-05-10 00:40:40', 'puca2@gmail.com', 'Guerreo', 'Nickelback', '$2a$10$Wmt2ZgxP1B3RNdcehPoRH.pOWYh2Wqx3b0AThfeB0Hskva8MgdhsO', '1234567891', '2014-05-10 00:40:40')
SELECT `cities`.* FROM `cities`
---
  def create
    @user = User.new(user_params)
    if @user.save
      session[:user_id] = @user.id
      redirect_to controller: "users", action: "show"

    else
      @cities = City.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
---
  def show
    @user = User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'sqqjuannn@hj.com' LIMIT 1
---
  def authenticate
    if params[:email].present? && params[:email].present?
      @user = User.find_by_email(params[:email])

SELECT `cities`.* FROM `cities`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 31 LIMIT 1
---
  def edit
    @cities = City.all
    @user = User.find(session[:user_id])

SELECT `cities`.* FROM `cities`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 31 LIMIT 1
UPDATE `users` SET `address` = 'Jose Amado Soler, Casi Lope De Vega', `password_digest` = '$2a$10$XyuM1Yr3SlWpbM.ylAi4s.xL8MbtsOGkoz46OTc/Q7KKiPVYLRwjq', `updated_at` = '2014-05-09 20:36:53' WHERE `users`.`id` = 31
---
  def update
    @cities = City.all
    @user = User.find_by_id(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 34
SELECT `users`.* FROM `users` WHERE `users`.`id` = 34 LIMIT 1
---
  def delete
    User.find(session[:user_id]).destroy